y1 <- c(2,4,6,8,6,4,3)
y2 <- c(2,3,6,5,8,5,3,2)
print(sort(y1))
print(sort(y2))
print(median(y1)) # 4
print(median(y2)) # 4
print(median(y1) - median(y2))

x1 <- c(2,3,4,5,6,7,8,9,10)
x2 <- c(2,3,4,5,6,7,8,9)
print(sort(x1))
print(sort(x2))
print(median(x1)) # 4
print(median(x2)) # 4
print(median(x1) - median(x2))

mydata <- rnorm(100, mean = 3, sd = 4)
print(quantile(mydata))

z <- c(3.3, 4.8, 8.2, 3.5, 2.9, 5.0, 5.3, 7.2, 4.1, 7.1, 4.5, 7.0, 3.1, 6.4, 5.3, 4.4, 6.1, 3.9, 6.5, 6.1, 7.6, 5.8, 4.5, 4.2,4.5,4.3,5.2,5.4,6.0,8.7,5.6,4.2,5.2,6.2,4.4,3.0,7.5,6.8,5.6,7.2,4.8,7.4,4.9,4.0,5.5,6.0,6.3,3.2,5.3,5.8,5.4,5.6,8.9,4.7,5.1,6,5.1,4.2,5.3,5.5)
z <- sort(z)
print(z)
print(mean(z)) # 5.426667
print(sd(z)) # 1.379003

t.test(z)

# Нормальное распределение данных и методы его оценки qqplot и shapiro.test
# Нормальное распределение данных характерно для количественных данных,
# на распределение которых влияет множество факторов, либо оно случайно.
# Нормальное распределение характеризуется несколькими особенностями:
# Оно всегда симметрично и имеет форму колокола.
# Значения среднего и медианы совпадают.
# В пределах одного стандартного отклонения в обе стороны лежат 68.2% всех данных,
# в пределах двух - 95,5%,
# в пределах трех - 99,7%

install.packages("car") #установка пакета "car"
library(car) #загрузка пакета "car" в среду R
qqPlot(z) #запустим тест

print(length(z)) # 60

a1 <- c(3,3,4,4,4,4,5,5,5,5,5,5,6,6,6,6,6,6,6,6,7,7,7,7,7,7,8,8,8,8,9,9,9)
print(median(a1)) # 6
a2 <- c(3,3,4,4,4,5,5,5,5,5,5,6,6,6,6,6,7,7,7,7,7,7,7,7,8,8,8,8,8,9,9,9,10,10)
print(median(a2)) # 7
print(median(a1) - median(a2)) # -1